ci/Jmeter/bf.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.9" jmeter="3.0 r1743807">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">bf-api.test.geointservices.io</stringProp>
        <stringProp name="HTTPSampler.protocol">https</stringProp>
        <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="timestamp" elementType="Argument">
            <stringProp name="Argument.name">timestamp</stringProp>
            <stringProp name="Argument.value">${__time(yyyy-MM-dd_HH.mm.ss)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="algServiceId" elementType="Argument">
            <stringProp name="Argument.name">algServiceId</stringProp>
            <stringProp name="Argument.value">576a74f8-4f50-4b86-95e9-0738bfeabfa6</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="rapideyeId" elementType="Argument">
            <stringProp name="Argument.name">rapideyeId</stringProp>
            <stringProp name="Argument.value">rapideye:20170115_034146_5061919_RapidEye-2</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PL_API" elementType="Argument">
            <stringProp name="Argument.name">PL_API</stringProp>
            <stringProp name="Argument.value">${__P(PL_API,)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Authorization</stringProp>
            <stringProp name="Header.value">${__P(auth,)}</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="Integration" enabled="true">
        <collectionProp name="ultimatethreadgroupdata">
          <collectionProp name="214986064">
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49592019">43200</stringProp>
          </collectionProp>
          <collectionProp name="1145896412">
            <stringProp name="49">1</stringProp>
            <stringProp name="45844119">01800</stringProp>
            <stringProp name="49534359">41400</stringProp>
          </collectionProp>
          <collectionProp name="77397263">
            <stringProp name="49">1</stringProp>
            <stringProp name="45901779">03600</stringProp>
            <stringProp name="48851088">39600</stringProp>
          </collectionProp>
          <collectionProp name="1021076792">
            <stringProp name="49">1</stringProp>
            <stringProp name="45959439">05400</stringProp>
            <stringProp name="48793428">37800</stringProp>
          </collectionProp>
          <collectionProp name="-745456713">
            <stringProp name="49">1</stringProp>
            <stringProp name="46017099">07200</stringProp>
            <stringProp name="48755949">36000</stringProp>
          </collectionProp>
          <collectionProp name="1846202656">
            <stringProp name="49">1</stringProp>
            <stringProp name="46074759">09000</stringProp>
            <stringProp name="48698289">34200</stringProp>
          </collectionProp>
          <collectionProp name="-1401971505">
            <stringProp name="49">1</stringProp>
            <stringProp name="1420937097">010800</stringProp>
            <stringProp name="48640629">32400</stringProp>
          </collectionProp>
          <collectionProp name="1166540257">
            <stringProp name="49">1</stringProp>
            <stringProp name="1420994757">012600</stringProp>
            <stringProp name="48582969">30600</stringProp>
          </collectionProp>
          <collectionProp name="930242996">
            <stringProp name="49">1</stringProp>
            <stringProp name="1421052417">014400</stringProp>
            <stringProp name="47899698">28800</stringProp>
          </collectionProp>
          <collectionProp name="572482432">
            <stringProp name="49">1</stringProp>
            <stringProp name="46910829">16200</stringProp>
            <stringProp name="47862219">27000</stringProp>
          </collectionProp>
          <collectionProp name="785924403">
            <stringProp name="49">1</stringProp>
            <stringProp name="1421167737">018000</stringProp>
            <stringProp name="47804559">25200</stringProp>
          </collectionProp>
          <collectionProp name="-1693062197">
            <stringProp name="49">1</stringProp>
            <stringProp name="1421205216">019800</stringProp>
            <stringProp name="47746899">23400</stringProp>
          </collectionProp>
          <collectionProp name="-514063121">
            <stringProp name="49">1</stringProp>
            <stringProp name="1421888487">021600</stringProp>
            <stringProp name="47689239">21600</stringProp>
          </collectionProp>
          <collectionProp name="-1247480885">
            <stringProp name="49">1</stringProp>
            <stringProp name="1421946147">023400</stringProp>
            <stringProp name="47005968">19800</stringProp>
          </collectionProp>
          <collectionProp name="-1913944141">
            <stringProp name="49">1</stringProp>
            <stringProp name="1422003807">025200</stringProp>
            <stringProp name="46968489">18000</stringProp>
          </collectionProp>
          <collectionProp name="-2099625284">
            <stringProp name="49">1</stringProp>
            <stringProp name="1422061467">027000</stringProp>
            <stringProp name="46910829">16200</stringProp>
          </collectionProp>
          <collectionProp name="-380068364">
            <stringProp name="49">1</stringProp>
            <stringProp name="1422098946">028800</stringProp>
            <stringProp name="46853169">14400</stringProp>
          </collectionProp>
          <collectionProp name="1612930305">
            <stringProp name="49">1</stringProp>
            <stringProp name="1422782217">030600</stringProp>
            <stringProp name="46795509">12600</stringProp>
          </collectionProp>
          <collectionProp name="-1207747921">
            <stringProp name="49">1</stringProp>
            <stringProp name="1422839877">032400</stringProp>
            <stringProp name="46737849">10800</stringProp>
          </collectionProp>
          <collectionProp name="-1486854272">
            <stringProp name="49">1</stringProp>
            <stringProp name="1422897537">034200</stringProp>
            <stringProp name="1745751">9000</stringProp>
          </collectionProp>
          <collectionProp name="-1888792114">
            <stringProp name="49">1</stringProp>
            <stringProp name="1422955197">036000</stringProp>
            <stringProp name="1688091">7200</stringProp>
          </collectionProp>
          <collectionProp name="-603420959">
            <stringProp name="49">1</stringProp>
            <stringProp name="1422992676">037800</stringProp>
            <stringProp name="1630431">5400</stringProp>
          </collectionProp>
          <collectionProp name="-248742550">
            <stringProp name="49">1</stringProp>
            <stringProp name="1423050336">039600</stringProp>
            <stringProp name="1572771">3600</stringProp>
          </collectionProp>
          <collectionProp name="-628189051">
            <stringProp name="49">1</stringProp>
            <stringProp name="1423733607">041400</stringProp>
            <stringProp name="1515111">1800</stringProp>
          </collectionProp>
          <collectionProp name="-1370592893">
            <stringProp name="49">1</stringProp>
            <stringProp name="1423791267">043200</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
        </collectionProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </kg.apc.jmeter.threads.UltimateThreadGroup>
      <hashTree>
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Constant Timer" enabled="true">
          <stringProp name="ConstantTimer.delay">5000</stringProp>
        </ConstantTimer>
        <hashTree/>
        <BeanShellAssertion guiclass="BeanShellAssertionGui" testclass="BeanShellAssertion" testname="Get Properties" enabled="true">
          <stringProp name="BeanShellAssertion.query">vars.put(&quot;mem&quot;,props.get(&quot;mem&quot;));
vars.put(&quot;cpu&quot;,props.get(&quot;cpu&quot;));</stringProp>
          <boolProp name="BeanShellAssertion.resetInterpreter">false</boolProp>
        </BeanShellAssertion>
        <hashTree/>
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="Clear dataId before loops" enabled="true">
          <stringProp name="BeanShellSampler.query">vars.put(&quot;status&quot;, &quot;Pending&quot;);
vars.put(&quot;count_job1&quot;, &quot;0&quot;);</stringProp>
          <stringProp name="BeanShellSampler.parameters">${__UUID}</stringProp>
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree/>
        <BeanShellAssertion guiclass="BeanShellAssertionGui" testclass="BeanShellAssertion" testname="Get Properties" enabled="true">
          <stringProp name="BeanShellAssertion.query">vars.put(&quot;mem&quot;,props.get(&quot;mem&quot;));
vars.put(&quot;cpu&quot;,props.get(&quot;cpu&quot;));</stringProp>
          <boolProp name="BeanShellAssertion.resetInterpreter">false</boolProp>
        </BeanShellAssertion>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Health Check" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">true</boolProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <BeanShellAssertion guiclass="BeanShellAssertionGui" testclass="BeanShellAssertion" testname="Get Properties" enabled="true">
          <stringProp name="BeanShellAssertion.query">vars.put(&quot;mem&quot;,props.get(&quot;mem&quot;));
vars.put(&quot;cpu&quot;,props.get(&quot;cpu&quot;));</stringProp>
          <boolProp name="BeanShellAssertion.resetInterpreter">false</boolProp>
        </BeanShellAssertion>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Create Job" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;algorithm_id&quot;: &quot;${algServiceId}&quot;,&#xd;
  &quot;scene_id&quot;: &quot;${rapideyeId}&quot;,&#xd;
  &quot;name&quot;: &quot;postman job&quot;,&#xd;
  &quot;planet_api_key&quot;: &quot;${PL_API}&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/v0/job</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Get JobId" enabled="true">
            <stringProp name="RegexExtractor.useHeaders">unescaped</stringProp>
            <stringProp name="RegexExtractor.refname">jobId_1</stringProp>
            <stringProp name="RegexExtractor.regex">([0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12})</stringProp>
            <stringProp name="RegexExtractor.template">$0$</stringProp>
            <stringProp name="RegexExtractor.default">foo</stringProp>
            <stringProp name="RegexExtractor.match_number">1</stringProp>
          </RegexExtractor>
          <hashTree/>
        </hashTree>
        <WhileController guiclass="WhileControllerGui" testclass="WhileController" testname="Job Status" enabled="true">
          <stringProp name="WhileController.condition">${__javaScript((&quot;${status}&quot; == &quot;Pending&quot; || &quot;${status}&quot; == &quot;Running&quot;) &amp;&amp; ${count_job1} &lt;= 360)}</stringProp>
        </WhileController>
        <hashTree>
          <BeanShellAssertion guiclass="BeanShellAssertionGui" testclass="BeanShellAssertion" testname="Get Properties" enabled="true">
            <stringProp name="BeanShellAssertion.query">vars.put(&quot;mem&quot;,props.get(&quot;mem&quot;));
vars.put(&quot;cpu&quot;,props.get(&quot;cpu&quot;));</stringProp>
            <boolProp name="BeanShellAssertion.resetInterpreter">false</boolProp>
          </BeanShellAssertion>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Check Job Status" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.path">/v0/job/${jobId_1}</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">true</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">true</boolProp>
            <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
            <boolProp name="HTTPSampler.monitor">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Get status" enabled="true">
              <stringProp name="RegexExtractor.useHeaders">unescaped</stringProp>
              <stringProp name="RegexExtractor.refname">status</stringProp>
              <stringProp name="RegexExtractor.regex">(&quot;status[&quot;: ]*)(\w+)(?=&quot;)</stringProp>
              <stringProp name="RegexExtractor.template">$2$</stringProp>
              <stringProp name="RegexExtractor.default">NotFound</stringProp>
              <stringProp name="RegexExtractor.match_number">1</stringProp>
            </RegexExtractor>
            <hashTree/>
          </hashTree>
          <CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="Counter" enabled="true">
            <stringProp name="CounterConfig.start">0</stringProp>
            <stringProp name="CounterConfig.end">500</stringProp>
            <stringProp name="CounterConfig.incr">1</stringProp>
            <stringProp name="CounterConfig.name">count_job1</stringProp>
            <boolProp name="CounterConfig.per_user">true</boolProp>
            <boolProp name="CounterConfig.reset_on_tg_iteration">true</boolProp>
          </CounterConfig>
          <hashTree/>
        </hashTree>
        <BeanShellAssertion guiclass="BeanShellAssertionGui" testclass="BeanShellAssertion" testname="Get Properties" enabled="true">
          <stringProp name="BeanShellAssertion.query">vars.put(&quot;mem&quot;,props.get(&quot;mem&quot;));
vars.put(&quot;cpu&quot;,props.get(&quot;cpu&quot;));</stringProp>
          <boolProp name="BeanShellAssertion.resetInterpreter">false</boolProp>
        </BeanShellAssertion>
        <hashTree/>
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="Check if Success" enabled="true">
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree>
          <BeanShellAssertion guiclass="BeanShellAssertionGui" testclass="BeanShellAssertion" testname="BeanShell Assertion" enabled="true">
            <stringProp name="BeanShellAssertion.query">Failure = !vars.get(&quot;status&quot;).equals(&quot;Success&quot;);</stringProp>
            <boolProp name="BeanShellAssertion.resetInterpreter">false</boolProp>
          </BeanShellAssertion>
          <hashTree/>
        </hashTree>
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="If Controller" enabled="true">
          <stringProp name="IfController.condition">${count_job1} &gt; 360</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
        </IfController>
        <hashTree>
          <TestAction guiclass="TestActionGui" testclass="TestAction" testname="Test Action" enabled="true">
            <intProp name="ActionProcessor.action">0</intProp>
            <intProp name="ActionProcessor.target">2</intProp>
          </TestAction>
          <hashTree/>
        </hashTree>
        <kg.apc.jmeter.reporters.AutoStop guiclass="kg.apc.jmeter.reporters.AutoStopGui" testclass="kg.apc.jmeter.reporters.AutoStop" testname="jp@gc - AutoStop Listener" enabled="false">
          <stringProp name="avg_response_time">0</stringProp>
          <stringProp name="avg_response_time_length">10</stringProp>
          <stringProp name="error_rate">1</stringProp>
          <stringProp name="error_rate_length">60</stringProp>
          <stringProp name="avg_response_latency">0</stringProp>
          <stringProp name="avg_response_latency_length">10</stringProp>
        </kg.apc.jmeter.reporters.AutoStop>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">./bf_load/run_job_ramp/${timestamp}/raw.csv</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="App Status Thread" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1490099548000</longProp>
        <longProp name="ThreadGroup.end_time">1490099548000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <SystemSampler guiclass="SystemSamplerGui" testclass="SystemSampler" testname="Get PCF token" enabled="true">
          <boolProp name="SystemSampler.checkReturnCode">false</boolProp>
          <stringProp name="SystemSampler.expectedReturnCode">0</stringProp>
          <stringProp name="SystemSampler.command">cf</stringProp>
          <elementProp name="SystemSampler.arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="Argument">
                <stringProp name="Argument.value">oauth-token</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <elementProp name="SystemSampler.environment" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </SystemSampler>
        <hashTree>
          <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Get Token" enabled="true">
            <stringProp name="RegexExtractor.useHeaders">unescaped</stringProp>
            <stringProp name="RegexExtractor.refname">oauth</stringProp>
            <stringProp name="RegexExtractor.regex">bearer.*</stringProp>
            <stringProp name="RegexExtractor.template">$0$</stringProp>
            <stringProp name="RegexExtractor.default">bearer ?????</stringProp>
            <stringProp name="RegexExtractor.match_number">1</stringProp>
          </RegexExtractor>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Get App Stats" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">api.devops.geointservices.io</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/v2/apps/${__P(app_guid,)}/stats</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">${oauth}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Get CPU" enabled="true">
            <stringProp name="RegexExtractor.useHeaders">unescaped</stringProp>
            <stringProp name="RegexExtractor.refname">cpu</stringProp>
            <stringProp name="RegexExtractor.regex">(&quot;cpu[&quot;: ]*)([\w\.]+)(?=,)</stringProp>
            <stringProp name="RegexExtractor.template">$2$</stringProp>
            <stringProp name="RegexExtractor.default">NaN</stringProp>
            <stringProp name="RegexExtractor.match_number">1</stringProp>
          </RegexExtractor>
          <hashTree/>
          <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Get Memory" enabled="true">
            <stringProp name="RegexExtractor.useHeaders">unescaped</stringProp>
            <stringProp name="RegexExtractor.refname">mem</stringProp>
            <stringProp name="RegexExtractor.regex">(&quot;mem[&quot;: ]*)([\w\.]+)(?=,)</stringProp>
            <stringProp name="RegexExtractor.template">$2$</stringProp>
            <stringProp name="RegexExtractor.default">NaN</stringProp>
            <stringProp name="RegexExtractor.match_number">1</stringProp>
          </RegexExtractor>
          <hashTree/>
        </hashTree>
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Constant Timer" enabled="true">
          <stringProp name="ConstantTimer.delay">5000</stringProp>
        </ConstantTimer>
        <hashTree/>
        <BeanShellAssertion guiclass="BeanShellAssertionGui" testclass="BeanShellAssertion" testname="Make Variables Global" enabled="true">
          <stringProp name="BeanShellAssertion.query">${__setProperty(cpu,${cpu})};
${__setProperty(mem,${mem})};</stringProp>
          <boolProp name="BeanShellAssertion.resetInterpreter">false</boolProp>
        </BeanShellAssertion>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>